alplabai/gd32-bridge-firmware/hal/fmc_ota.c
/*
 * Copyright 2026 Alp Lab AB
 * SPDX-License-Identifier: Apache-2.0
 *
 * gd32-bridge OTA — flash backend (gd32 HAL backend). Real FMC erase /
 * doubleword-program for the inactive slot + metadata, and the system
 * reset used at commit.  Overrides the weak no-ops in src/ota.c.
 *
 * In the partitioned build the erase/program inner loop must execute
 * from RAM — the FMC stalls the bus, so a routine fetched from the bank
 * being written faults.  The OTA_RAMFUNC attribute places these in
 * `.ramfunc` (which the partitioned app linker folds into .data); the
 * default full-flash build leaves the attribute empty (OTA is inert
 * there, so the loop never runs).  SILICON-VALIDATED 2026-06-04: full
 * dual-bank erase + 760-chunk program + commit/rollback cycle on the
 * bench.
 *
 * The RAMFUNC bodies are deliberately SELF-CONTAINED register-level
 * mirrors of the vendor fmc_page_erase / fmc_doubleword_program
 * (gd32g5x3_fmc.c) rather than wrappers calling them: the vendor
 * routines — including their fmc_ready_wait poll loop — live in flash,
 * so a thin RAM shim around them would re-enter flash for the entire
 * FMC busy window and defeat the .ramfunc guarantee.  Everything
 * fetched between setting START/PG and BUSY clearing (code AND literal
 * pools, which GCC emits into the function's own section) must be
 * RAM-resident.  FMC_STAT/FMC_CTL accesses are peripheral-bus reads,
 * not flash reads — polling them from RAM is safe while FMC is busy.
 */

#include <string.h>

#include "gd32g5x3.h"

#include "gd32/bridge_critical.h"

#include "fmc_ota.h"
#include "fmc_ota_guard.h"
#include "ota_layout.h"

#if defined(BRIDGE_OTA_PARTITIONED)
#define OTA_RAMFUNC __attribute__((section(".ramfunc"), noinline))
#else
#define OTA_RAMFUNC
#endif

/* Vendor-private bit offset of FMC_CTL.PNSEL (gd32g5x3_fmc.c
 * CTL_PNSEL_OFFSET); the public header only exposes the BITS(3,10) mask. */
#define OTA_FMC_CTL_PNSEL_OFFSET 3u

/* Dual-bank geometry (silicon-verified 2026-06-04: the V2N's GD32G553
 * ships with OBCTL.DBS = 1).  In dual-bank mode the page is 1 KB (vendor
 * MAIN_FLASH_PAGE_SIZE_DBANK) and addresses >= bank1 base need
 * FMC_CTL.BKSEL with a bank-relative page index; single-bank mode is
 * 2 KB pages, bank0 only.  Getting this wrong "succeeds" loudly:
 * page indexes silently resolve into bank0 and erase the wrong region
 * (caught on silicon as a PGERR on the first slot-B program). */
#define OTA_FMC_BANK1_BASE      0x08040000u
#define OTA_FMC_PAGE_SIZE_DBANK 0x400u
#define OTA_FMC_PAGE_SIZE_SBANK 0x800u

/* Sticky FMC_STAT error flags (rc_w1).  MUST be cleared before each
 * erase/program: one failed op otherwise poisons every later
 * ota_fmc_wait_ready with the latched error (silicon-verified: a single
 * PGERR short-circuited the whole remaining OTA session). */
#define OTA_FMC_STAT_ERR_MASK \
	(FMC_STAT_WPERR | FMC_STAT_PGERR | FMC_STAT_PGSERR | FMC_STAT_PGAERR | FMC_STAT_RPERR | \
	 FMC_STAT_PGMERR | FMC_STAT_OBERR)

/* Masked-window poll budgets (blocker fix on top of #5).  FMC_TIMEOUT_COUNT
 * (vendor gd32g5x3_fmc.h) is 0xFFFFFFFF -- a raw decrement count, not a time
 * bound.  Fine when the poll runs with interrupts enabled (any other caller
 * of ota_fmc_wait_ready in this file): a stuck FMC just leaves the ISRs
 * still servicing SPI/I2C.  Deadly inside the two PRIMASK-masked windows
 * added for #5 (erase_one_page's START..BUSY span, program_one_dword's
 * PG..BUSY span): a genuine flash-controller fault would spin the full
 * ~4.295e9 iterations with every interrupt off, on the order of minutes at
 * 216 MHz, with no watchdog anywhere in the tree (#54) to recover it.
 *
 * These two constants replace FMC_TIMEOUT_COUNT at ONLY the masked call
 * sites (erase_one_page's second wait, program_one_dword's second wait);
 * the pre-mask waits stay on FMC_TIMEOUT_COUNT because interrupts are still
 * live there.
 *
 * Derivation (no -O level is pinned in CMakeLists.txt -- #26 -- so this has
 * to hold at both ends of the range actually built; verified against
 * -O0 and -Os disassembly of this exact loop):
 *
 *   ota_fmc_wait_ready()'s busy-poll loop body (ota_fmc_state_now() inlined
 *   + the decrement/branch) disassembles, per `arm-none-eabi-objdump -d`
 *   on gd32-bridge-slot-a, to:
 *     -O0: 17 Thumb instructions/iteration
 *     -Os: 5 Thumb instructions/iteration (register-resident, no frame)
 *   Assume <= 4 cycles/instruction -- deliberately generous for Cortex-M33
 *   single-cycle ALU/compare ops, covering a taken branch's pipeline
 *   refill and any AHB wait state on the FMC_STAT read while the
 *   controller is busy, neither of which this file can measure without a
 *   bench trace.
 *     -O0: 17 * 4 = 68 cycles/iter -> 68 / 216e6 Hz  = 314.8 ns/iter
 *     -Os:  5 * 4 = 20 cycles/iter -> 20 / 216e6 Hz  =  92.6 ns/iter
 *
 *   Target budget = datasheet max x10 margin (GD32G553xx Datasheet Rev2.0
 *   p.126, Table 4-25 non-volatile-memory characteristics):
 *     tERASE (page erase time) max = 20 ms  -> budget 200 ms
 *     tPROG  (doubleword program time) max = 80 us -> budget 800 us
 *
 *   Iteration count is sized off the FASTER build (-Os, fewer cycles per
 *   iteration) so a legitimate near-max-spec op is never cut off early in
 *   an -Os build: iterations = budget / time_per_iter(-Os).
 *     erase:   200e-3 s / 92.6e-9 s  ~= 2,159,827  -> OTA_FMC_ERASE_TIMEOUT_ITERS  = 2,200,000
 *     program: 800e-6 s / 92.6e-9 s  ~=     8,639  -> OTA_FMC_PROGRAM_TIMEOUT_ITERS =     9,000
 *
 *   Checked against the SLOWER build (-O0, more cycles per iteration) to
 *   confirm the fault-case bound stays far short of the current ~minutes:
 *     erase:   2,200,000 * 314.8 ns ~= 693 ms
 *     program:     9,000 * 314.8 ns ~=   2.8 ms
 */
#define OTA_FMC_ERASE_TIMEOUT_ITERS   2200000u
#define OTA_FMC_PROGRAM_TIMEOUT_ITERS 9000u

bool ota_fmc_supported(void)
{
	return true;
}

/* RAM-safe FMC state decode (vendor fmc_state_get, inlined so the
 * RAMFUNC callers never branch to a flash-resident helper while the
 * FMC is busy).  Decode order mirrors the vendor exactly. */
__attribute__((always_inline)) static inline fmc_state_enum ota_fmc_state_now(void)
{
	if ((FMC_STAT & FMC_STAT_BUSY) != 0u) {
		return FMC_BUSY;
	}
	if ((FMC_STAT & FMC_STAT_WPERR) != 0u) {
		return FMC_WPERR;
	}
	if ((FMC_STAT & FMC_STAT_PGERR) != 0u) {
		return FMC_PGERR;
	}
	if ((FMC_STAT & FMC_STAT_PGSERR) != 0u) {
		return FMC_PGSERR;
	}
	if ((FMC_STAT & FMC_STAT_PGAERR) != 0u) {
		return FMC_PGAERR;
	}
	if ((FMC_STAT & FMC_STAT_RPERR) != 0u) {
		return FMC_RPERR;
	}
	if ((FMC_STAT & FMC_STAT_PGMERR) != 0u) {
		return FMC_PGMERR;
	}
	if ((FMC_STAT & FMC_STAT_OBERR) != 0u) {
		return FMC_OBERR;
	}
	return FMC_READY;
}

/* RAM-safe fmc_ready_wait (vendor decode + timeout, inlined). */
__attribute__((always_inline)) static inline fmc_state_enum ota_fmc_wait_ready(uint32_t timeout)
{
	fmc_state_enum st;
	do {
		st = ota_fmc_state_now();
		timeout--;
	} while ((st == FMC_BUSY) && (timeout != 0u));
	return (st == FMC_BUSY) ? FMC_TOERR : st;
}

OTA_RAMFUNC static fmc_state_enum erase_one_page(uint32_t addr)
{
	const bool dual = (FMC_OBCTL & FMC_OBCTL_DBS) != 0u;
	uint32_t   page;
	bool       bank1 = false;

	if (dual) {
		bank1 = (addr >= OTA_FMC_BANK1_BASE);
		page =
		    (addr - (bank1 ? OTA_FMC_BANK1_BASE : OTA_BOOTLOADER_BASE)) / OTA_FMC_PAGE_SIZE_DBANK;
	} else {
		page = (addr - OTA_BOOTLOADER_BASE) / OTA_FMC_PAGE_SIZE_SBANK;
	}

	/* Clear stale sticky errors BEFORE the readiness wait: a latched
     * PGERR from an earlier failed session is not "busy", but the
     * decode reports it ahead of READY and would wedge every later op
     * (silicon-caught 2026-06-04: one failed run poisoned the next
     * session's first erase). */
	FMC_STAT = OTA_FMC_STAT_ERR_MASK;

	fmc_state_enum st = ota_fmc_wait_ready(FMC_TIMEOUT_COUNT);
	if (st != FMC_READY) {
		return st;
	}
	if (bank1) {
		FMC_CTL |= FMC_CTL_BKSEL;
	} else {
		FMC_CTL &= ~FMC_CTL_BKSEL;
	}
	FMC_CTL &= ~FMC_CTL_PNSEL;
	FMC_CTL |= page << OTA_FMC_CTL_PNSEL_OFFSET;
	FMC_CTL |= FMC_CTL_PER;

	/* #5: mask interrupts for exactly the busy window (START set ->
     * BUSY clear).  A vector fetch taken while this page's bank is busy
     * is undefined per the vendor manual (UM Rev1.2 p.97, 2.3.6: "the
     * software may run out of control ... The FMC will not provide any
     * notification when it occurs") and unflagged (p.115-116 FMC_STAT
     * has no busy-read-during-op bit).  Both this function and
     * program_one_dword must stay in lockstep -- masking only one path
     * leaves the other exposed.  Save/restore rather than a bare
     * enable/disable pair so a caller that is itself already inside a
     * masked section is not silently unmasked on return.
     *
     * Transport-blackout consequence (Major, PR #92 review): SPI's
     * CS-rising EXTI runs protocol_dispatch() synchronously (#19) and
     * arms the DMA reply buffer.  A CS edge that lands anywhere in this
     * masked window merely pends -- the master clocks out whatever stale
     * DMA content is already staged.  I2C is hardware-stretched instead
     * (i2c_stretch_scl_low_enable(), transport_hw_gd32.c) so it degrades
     * to added latency rather than corrupt content, up to the master's
     * own bus-timeout budget.  Not fixable here; #19 owns it.
     *
     * OTA_FMC_ERASE_TIMEOUT_ITERS (not FMC_TIMEOUT_COUNT) bounds this
     * wait -- see the derivation comment above OTA_FMC_ERASE_TIMEOUT_ITERS.
     * FMC_TIMEOUT_COUNT is fine on every OTHER ota_fmc_wait_ready() call in
     * this file: those run with interrupts still enabled. */
	/* RAW CMSIS intrinsics here, deliberately NOT bridge_irq_lock() /
     * bridge_irq_unlock() from hal/gd32/bridge_critical.h, even though
     * they do exactly this.  Those are `static inline`, and this build
     * pins no -O level at all (#26): at -O0 GCC does not inline a
     * `static inline` -- it emits an out-of-line copy in .text, i.e. in
     * FLASH.  A call from this OTA_RAMFUNC into flash while the bank is
     * busy is precisely the undefined fetch this masked window exists to
     * prevent.  __get_PRIMASK / __disable_irq / __set_PRIMASK compile to
     * single MRS / CPSID / MSR instructions with no call, at every -O
     * level.  Do not "unify" these with the shared helper.
     *
     * fmc_funnel_claim() below DOES use the shared helper, and that is
     * fine: it runs before fmc_unlock(), with the flash idle. */
	const uint32_t pm = __get_PRIMASK();
	__disable_irq();
	FMC_CTL |= FMC_CTL_START;
	st = ota_fmc_wait_ready(OTA_FMC_ERASE_TIMEOUT_ITERS);
	__set_PRIMASK(pm);

	FMC_CTL &= ~FMC_CTL_PER;
	FMC_CTL &= ~FMC_CTL_PNSEL;
	FMC_CTL &= ~FMC_CTL_BKSEL;
	return st;
}

/* ---- FMC funnel ownership (#147) ------------------------------------- *
 *
 * Every FMC operation in this file brackets its work in fmc_unlock() ...
 * fmc_lock(), and the vendor's pair is NOT nesting-aware: fmc_unlock()
 * early-returns when LK is already clear, and fmc_lock() unconditionally
 * SETS LK.  So a second, nested operation's terminating fmc_lock()
 * re-locks the register out from under the first one.
 *
 * That is reachable purely over the wire.  ota_erase_tick() runs at BASE
 * level and walks the slot a page-region per tick; a transport ISR can
 * dispatch an OTA opcode into meta_commit -> ota_fmc_erase_range /
 * ota_fmc_program at any point inside that walk.  The ISR's fmc_lock()
 * then leaves the base loop writing FMC_CTL_PER and FMC_CTL_START into a
 * locked register.  Worse, there is a second collision in the same
 * window that has nothing to do with LK: the ISR sets FMC_CTL_PG while
 * the pre-empted erase still has FMC_CTL_PER set, and each side's
 * `FMC_CTL &= ~...` read-modify-writes clobber what the other left.
 *
 * A depth-counting unlock/lock pair would fix the LK half and leave the
 * PER-vs-PG half wide open, so this is an OWNERSHIP interlock instead:
 * one operation at a time, full stop.  The loser is refused and reports
 * failure rather than corrupting the winner.
 *
 * The claim is held for a whole erase-range or program call and released
 * before returning; interrupts are masked only across the test-and-set
 * (see hal/gd32/bridge_critical.h).  Nothing spins waiting, so there is
 * no deadlock: an ISR that loses simply fails its FMC op.
 *
 * NOT RESOLVED, and it does not change this fix: whether a write to a
 * LOCKED FMC_CTL is silently discarded or latches WPERR is a GD32G553
 * User Manual lookup nobody has done.  The silent variant is materially
 * worse -- ota_fmc_wait_ready() returns FMC_READY on its first poll and
 * erase_one_page() reports SUCCESS for a page it did not erase, so
 * ota_erase_tick() advances and flips the state to OTA_ST_READY over an
 * un-erased tail, and the next h_write into it PGERRs.  But BOTH
 * outcomes leave an un-erased page, so preventing the re-entry is right
 * either way; the lookup only sizes how bad the un-fixed case was. */
static volatile bool s_fmc_owned;

/* True = the caller owns the funnel and MUST release before returning. */
static bool fmc_funnel_claim(void)
{
	const uint32_t sect     = bridge_irq_lock();
	const bool     free_now = !s_fmc_owned;

	if (free_now) {
		s_fmc_owned = true;
	}
	bridge_irq_unlock(sect);
	return free_now;
}

static void fmc_funnel_release(void)
{
	s_fmc_owned = false; /* single aligned store; no section needed */
}

bool ota_fmc_erase_range(uint32_t base, uint32_t len)
{
	/* Layout regions stay OTA_PAGE_SIZE-granular (2 KB -- a multiple of
     * the real page in both bank modes); the erase loop walks the REAL
     * page size so dual-bank (1 KB pages) erases every page. */
	if ((base % OTA_PAGE_SIZE) != 0u || (len % OTA_PAGE_SIZE) != 0u) {
		return false;
	}
	if (ota_fmc_range_forbidden(base, len)) {
		return false; /* #79: bootloader / running-slot -- refused, not erased */
	}
	/* One owner at a time (#147).  Refusing is the whole point: the
     * caller that loses must NOT proceed into the funnel.
     *
     * Ordered AFTER the #79 range guard on purpose: a request aimed at
     * the bootloader or the running slot is refused on its own merits and
     * must never take the funnel, so it cannot make a concurrent, LEGAL
     * erase fail by holding ownership while it gets rejected anyway. */
	if (!fmc_funnel_claim()) {
		return false;
	}
	const uint32_t step =
	    ((FMC_OBCTL & FMC_OBCTL_DBS) != 0u) ? OTA_FMC_PAGE_SIZE_DBANK : OTA_FMC_PAGE_SIZE_SBANK;
	bool ok = true;
	fmc_unlock();
	for (uint32_t a = base; a < base + len; a += step) {
		if (erase_one_page(a) != FMC_READY) {
			ok = false;
			break;
		}
	}
	fmc_lock();
	fmc_funnel_release();
	return ok;
}

OTA_RAMFUNC static fmc_state_enum program_one_dword(uint32_t addr, uint64_t dw)
{
	FMC_STAT = OTA_FMC_STAT_ERR_MASK; /* stale errors are not busy */

	fmc_state_enum st = ota_fmc_wait_ready(FMC_TIMEOUT_COUNT);
	if (st != FMC_READY) {
		return st;
	}
	/* #5: same masked busy window as erase_one_page, PG set -> BUSY
     * clear.  Both sites move in lockstep -- see the comment there,
     * including the transport-blackout note (#19) and why this uses
     * OTA_FMC_PROGRAM_TIMEOUT_ITERS rather than FMC_TIMEOUT_COUNT. */
	/* Raw intrinsics, not bridge_irq_lock() -- same RAMFUNC-must-not-call-
     * flash argument as in erase_one_page. */
	const uint32_t pm = __get_PRIMASK();
	__disable_irq();
	FMC_CTL |= FMC_CTL_PG;
	REG32(addr) = (uint32_t)(dw & 0xFFFFFFFFu);
	__ISB();
	REG32(addr + 4u) = (uint32_t)(dw >> 32);
	st               = ota_fmc_wait_ready(OTA_FMC_PROGRAM_TIMEOUT_ITERS);
	__set_PRIMASK(pm);

	FMC_CTL &= ~FMC_CTL_PG;
	return st;
}

bool ota_fmc_program(uint32_t addr, const uint8_t *data, size_t len)
{
	/* GD32G5 programs in 64-bit doublewords; `addr` must be 8-byte aligned
     * (the host paces chunk offsets on 8-byte boundaries). Pad a short tail
     * with 0xFF (erased state). */
	if ((addr % 8u) != 0u) {
		return false;
	}
	if (ota_fmc_range_forbidden(addr, (uint32_t)len)) {
		return false; /* #79: bootloader / running-slot -- refused, not programmed */
	}
	/* Range guard first, then ownership -- same ordering argument as in
     * ota_fmc_erase_range above. */
	if (!fmc_funnel_claim()) {
		return false; /* #147 -- see fmc_funnel_claim */
	}
	bool ok = true;
	fmc_unlock();
	for (size_t i = 0u; i < len; i += 8u) {
		uint8_t      buf[8];
		const size_t n = (len - i > 8u) ? 8u : (len - i);
		for (size_t k = 0u; k < 8u; k++) {
			buf[k] = (k < n) ? data[i + k] : 0xFFu;
		}
		uint64_t dw;
		memcpy(&dw, buf, sizeof dw);
		if (program_one_dword(addr + (uint32_t)i, dw) != FMC_READY) {
			ok = false;
			break;
		}
	}
	fmc_lock();
	fmc_funnel_release();
	return ok;
}

void ota_system_reset(void)
{
	NVIC_SystemReset();
}
